#### IPipeFittingAndAccessoryPressureDropUIServer Members

---

|  |
| --- |
| IPipeFittingAndAccessoryPressureDropUIServer Interface   Methods   See Also |

The  IPipeFittingAndAccessoryPressureDropUIServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetDBServerId | Returns the Id of the corresponding DB server for which this server provides an optional UI. |
| Public method | GetDescription | Implement this method to return a description of the server. (Inherited from  IExternalServer  .) |
| Public method | GetName | Implement this method to return the name of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServerId | Implement this method to return the id of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServiceId | Implement this method to return the id of the service. (Inherited from  IExternalServer  .) |
| Public method | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from  IExternalServer  .) |
| Public method | ShowSettings | Shows the settings UI. |

# See Also

IPipeFittingAndAccessoryPressureDropUIServer Interface

Autodesk.Revit.UI.Plumbing Namespace